bench/results/raw/h2-20260923-164706/caddy-h2-_big.bin-16-1.txt
starting benchmark...
spawning thread #0: 4 total client(s). 250 total requests
spawning thread #1: 4 total client(s). 250 total requests
spawning thread #2: 4 total client(s). 250 total requests
spawning thread #3: 4 total client(s). 250 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 4.74s, 211.13 req/s, 2.06GB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.77GB (10491551656) total, 12.29KB (12584) headers (space savings 94.12%), 9.77GB (10485760000) data
                     min         max         mean         sd        +/- sd
time for request:     5.33ms    100.31ms     74.57ms      9.12ms    81.60%
time for connect:      446us      1.66ms      1.23ms       333us    68.75%
time to 1st byte:     2.23ms     26.14ms      6.48ms      8.58ms    81.25%
req/s           :      13.10       13.76       13.41        0.19    62.50%